""" 
Циклы используются для перебора элементов последовательностей.
Итерируемый объект (itarable) - объект, который может быть преращен в итератор (коллекция или последовательности элементов)
Итератор (iterator) - объект, который предоставляет метод __next__ для последовательного доступа к элементам. 
Итератор хранит текущее соостояние итерации и знает какой элемент будет следующим

Последовательности (коллекции):
1) list - список
2) dict - словарь
3) set - набор 
4) tuple - кортеж
5) str - строка
6) range - диапазон
7) модуль array - массив

Циклы:
1) for
2) сокращенный for
3) while
"""

#* Коллекции

my_list = ["cat", "dog", "dog", "cat", "bird"]
my_dict = {"name": "anton", "height": 180, "age": 33}


